tap "isen-ng/dotnet-sdk-versions"
tap "ngrok/ngrok"
brew "changie"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "glab"
brew "gnupg"
brew "helm"
brew "kubernetes-cli"
brew "krew"
brew "lazygit"
brew "python@3.13"
brew "mono"
brew "mono-libgdiplus"
brew "nmap"
brew "nvm"
brew "openconnect"
brew "openjdk@11"
brew "openjdk@21"
brew "pandoc"
brew "pinentry-mac"
brew "pure"
brew "sqlcmd"
brew "task"
brew "yarn"
brew "zsh"
cask "1password"
cask "1password-cli"
cask "docker-desktop"
cask "dotnet-sdk8"
cask "dotnet-sdk8-0-400"
cask "dotnet-sdk9"
cask "dotnet-sdk9-0-300"
cask "iterm2"
cask "kap"
cask "microsoft-auto-update"
cask "microsoft-outlook"
cask "microsoft-teams"
cask "mono-mdk"
cask "ngrok"
cask "parallels"
cask "powershell"
cask "spotify"
cask "visual-studio-code"
cask "windows-app"
vscode "1password.op-vscode"
vscode "a11ychecker.a11y-checker"
vscode "a11ylint.a11ylint"
vscode "alefragnani.project-manager"
vscode "amodio.tsl-problem-matcher"
vscode "angular.ng-template"
vscode "atlassian.atlascode"
vscode "automatalabs.copilot-mcp"
vscode "benjaminbenais.copilot-theme"
vscode "christian-kohler.npm-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dionmunk.vscode-notes"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dontshavetheyak.groovy-guru"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "fengtan.ldap-explorer"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "gitlab.gitlab-workflow"
vscode "gruntfuggly.todo-tree"
vscode "hbenl.vscode-test-explorer"
vscode "imzivko.cursor-dark-core"
vscode "jamief.vscode-ssh-config-enhanced"
vscode "janjoerke.jenkins-pipeline-linter-connector"
vscode "jasonn-porch.gitlab-mr"
vscode "johnpapa.angular2"
vscode "maarti.jenkins-doc"
vscode "maxvanderschee.web-accessibility"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "mindaro-dev.file-downloader"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.extension-test-runner"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-speech"
vscode "nicolasvuillamy.vscode-groovy-lint"
vscode "orta.vscode-jest"
vscode "p1c2u.docker-compose"
vscode "patcx.vscode-nuget-gallery"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "sandipchitale.vscode-kubewatch"
vscode "sonarsource.sonarlint-vscode"
vscode "tabeyti.jenkins-jack"
vscode "tim-koehler.helm-intellisense"
vscode "upstash.context7-mcp"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "yzhang.markdown-all-in-one"
