tap "isen-ng/dotnet-sdk-versions"
tap "ngrok/ngrok"
brew "python@3.13"
brew "ansible"
brew "dockutil"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "gnupg"
brew "helm"
brew "jenkins-lts"
brew "kubernetes-cli"
brew "lazygit"
brew "minikube"
brew "mono"
brew "mono-libgdiplus"
brew "nmap"
brew "nvm"
brew "openapi-generator"
brew "openconnect"
brew "openjdk@17", link: true
brew "pinentry-mac"
brew "powerlevel10k"
brew "pstree"
brew "pure"
brew "snyk-cli"
brew "sqlcmd"
brew "sshpass"
brew "swagger-codegen"
brew "thefuck"
brew "trivy"
brew "websocat"
brew "wget"
brew "yarn"
brew "zsh"
cask "1password"
cask "1password-cli"
cask "azure-data-studio"
cask "docker-desktop"
cask "dotnet-sdk8"
cask "dotnet-sdk8-0-400"
cask "dotnet-sdk9"
cask "dotnet-sdk9-0-300"
cask "iterm2"
cask "kap"
cask "microsoft-auto-update"
cask "microsoft-outlook"
cask "microsoft-teams"
cask "mono-mdk"
cask "ngrok"
cask "parallels"
cask "powershell"
cask "spotify"
cask "visual-studio-code"
cask "windows-app"
vscode "a11ychecker.a11y-checker"
vscode "a11ylint.a11ylint"
vscode "alefragnani.project-manager"
vscode "amodio.tsl-problem-matcher"
vscode "angular.ng-template"
vscode "atlassian.atlascode"
vscode "automatalabs.copilot-mcp"
vscode "benjaminbenais.copilot-theme"
vscode "christian-kohler.npm-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "fengtan.ldap-explorer"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "gitlab.gitlab-workflow"
vscode "gruntfuggly.todo-tree"
vscode "hbenl.vscode-test-explorer"
vscode "imzivko.cursor-dark-core"
vscode "jamief.vscode-ssh-config-enhanced"
vscode "jasonn-porch.gitlab-mr"
vscode "johnpapa.angular2"
vscode "maxvanderschee.web-accessibility"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "mindaro-dev.file-downloader"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-playwright.playwright"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-speech"
vscode "mtxr.sqltools"
vscode "orta.vscode-jest"
vscode "p1c2u.docker-compose"
vscode "patcx.vscode-nuget-gallery"
vscode "redhat.vscode-yaml"
vscode "sandipchitale.vscode-kubewatch"
vscode "sonarsource.sonarlint-vscode"
vscode "tim-koehler.helm-intellisense"
vscode "upstash.context7-mcp"
vscode "vscodevim.vim"
vscode "ziyasal.vscode-open-in-github"
